class script(object):

    START_TXT = """<b>✨ ʜᴇʟʟᴏ {}!</b>

🚀 <b>ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ {}!</b>  

ᴛʜɪs ʙᴏᴛ sᴜʙsᴄʀɪᴘᴛɪᴏɴ ɪs ғᴜʟʟʏ ᴀᴜᴛᴏᴍᴀᴛɪᴄ. ᴀᴀᴘ ᴀᴘɴᴇ ʜɪsᴀʙ sᴇ ᴘʟᴀɴ sᴇʟᴇᴄᴛ ᴋᴀʀᴋᴇ ᴘʀᴇᴍɪᴜᴍ ᴇɴᴊᴏʏ ᴋᴀʀ sᴀᴋᴛᴇ ʜᴀɪɴ. 🚀"""
    
    LOG_TEXT = """<b>🚀 #ɴᴇᴡᴜsᴇʀ {}

👤 ɴᴀᴍᴇ - {}
🆔 ɪᴅ - <code>{}</code>
🔗 ᴜsᴇʀɴᴀᴍᴇ - {}
⏰ ᴛɪᴍᴇ - {} 
📅 ᴅᴀᴛᴇ - {}
🌍 ᴛɪᴍᴇᴢᴏɴᴇ - ᴀsɪᴀ/ᴋᴏʟᴋᴀᴛᴀ</b>"""

    HELP_TXT = """<b>❓ ɴᴇᴇᴅ ʜᴇʟᴘ ᴏʀ sᴜᴘᴘᴏʀᴛ? 🤖</b>

<i>ғᴏʀ ᴀʟʟ ǫᴜᴇʀɪᴇs ʀᴇʟᴀᴛᴇᴅ ᴛᴏ sᴜʙsᴄʀɪᴘᴛɪᴏɴs, ᴘʟᴀɴs, ᴏʀ ᴀɴʏᴛʜɪɴɢ ᴇʟsᴇ, ᴊᴜsᴛ ʀᴇᴀᴄʜ ᴏᴜᴛ ᴛᴏ ᴏᴜʀ ᴀᴅᴍɪɴs ᴀɴᴅ ᴡᴇ ᴡɪʟʟ ɢᴇᴛ ʙᴀᴄᴋ ᴛᴏ ʏᴏᴜ ᴀs sᴏᴏɴ ᴀs ᴘᴏssɪʙʟᴇ! ⚡📩</i>

<blockquote><b>📝 ᴛᴇʀᴍs & ᴄᴏɴᴅɪᴛɪᴏɴs:</b>
🔸 sᴇɴᴅ ᴀ ᴄʟᴇᴀʀ ᴘᴀʏᴍᴇɴᴛ sᴄʀᴇᴇɴsʜᴏᴛ — ғᴀᴋᴇ ᴏʀ ᴇᴅɪᴛᴇᴅ ᴘʀᴏᴏғs ᴡɪʟʟ ʟᴇᴀᴅ ᴛᴏ ᴀ ʙᴀɴ.
🔸 ᴘʟᴇᴀsᴇ ᴡᴀɪᴛ ᴘᴀᴛɪᴇɴᴛʟʏ ғᴏʀ ᴀᴘᴘʀᴏᴠᴀʟ — ᴅᴏ ɴᴏᴛ sᴘᴀᴍ ᴛʜᴇ ʙᴏᴛ.
🔸 ɴᴏ ʀᴇғᴜɴᴅs ᴡɪʟʟ ʙᴇ ɪssᴜᴇᴅ ᴀғᴛᴇʀ ᴘʀᴇᴍɪᴜᴍ ᴀᴄᴛɪᴠᴀᴛɪᴏɴ.</blockquote>

<b>🆘 sᴜᴘᴘᴏʀᴛ & ᴄᴏɴᴛᴀᴄᴛs:</b>
🔹 ᴡᴇ ᴀʀᴇ ᴄᴏᴍᴍɪᴛᴛᴇᴅ ᴛᴏ ғᴀsᴛ, sᴀғᴇ & ʀᴇʟɪᴀʙʟᴇ sᴇʀᴠɪᴄᴇ.  
🔹 ᴄᴏɴᴛᴀᴄᴛ ᴀᴅᴍɪɴ: <b>@XP_Owner_BoT</b>  
🔹 sᴜᴘᴘᴏʀᴛ ᴄʜᴀɴɴᴇʟ: <b>@TenxHubSupport</b>"""

    ABOUT_TXT = """<b>╔═══❰  {}  ❱═══❍
║╭━━━━━━━━━━━━━━━➣
║┣⪼🤖 ᴍʏ ɴᴀᴍᴇ : {}
║┣⪼👑 ᴏᴡɴᴇʀ : <a href='https://t.me/XP_Owner_BoT'>xᴘ ᴏᴡɴᴇʀ</a>
║┣⪼👦 ᴅᴇᴠᴇʟᴏᴘᴇʀ : <a href='https://t.me/BOT_OWNER26'>ᴀᴍᴀɴ ᴅᴇᴠᴇʟᴏᴘᴇʀ</a>
║┣⪼❣️ ᴜᴘᴅᴀᴛᴇ : <a href='https://t.me/TenxHubBackup'>xᴘ ʙᴏᴛᴢ</a>
║┣⪼📡 ʜᴏsᴛᴇᴅ ᴏɴ : ᴋᴏʏᴇʙ 
║┣⪼🗣️ ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ 3
║┣⪼📚 ʟɪʙʀᴀʀʏ : ᴘʏʀᴏɢʀᴀᴍ
║┣⪼🗒️ ᴠᴇʀsɪᴏɴ : ᴀᴅᴠᴀɴᴄᴇ ᴠ2.01
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍ </b>"""
    
    CHECK_TXT = """<blockquote>🎖️ ᴀᴠᴀɪʟᴀʙʟᴇ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴs :</blockquote>

<i>❏ ₹𝟷𝟻   ➠ 𝟷 ᴡᴇᴇᴋ ᴀᴄᴄᴇss  
❏ ₹𝟹𝟿   ➠ 𝟷 ᴍᴏɴᴛʜ 
❏ ₹𝟽𝟻   ➠ 𝟸 ᴍᴏɴᴛʜs  
❏ ₹𝟷𝟷𝟶 ➠ 𝟹 ᴍᴏɴᴛʜs  
❏ ₹𝟷𝟿𝟿 ➠ 𝟼 ᴍᴏɴᴛʜs
❏ ₹𝟹𝟼𝟶 ➠ 𝟷𝟸 ᴍᴏɴᴛʜs</i> <b>(ʙᴇsᴛ ᴠᴀʟᴜᴇ)</b>

<b>⚠️ ᴀғᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ:</b>  
<i>📸 sᴇɴᴅ ʏᴏᴜʀ ᴘᴀʏᴍᴇɴᴛ sᴄʀᴇᴇɴsʜᴏᴛ ғᴏʀ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ.</i>

<b><u>👇 ᴄʜᴏᴏsᴇ ʏᴏᴜʀ ᴘʟᴀɴ ғʀᴏᴍ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ.</u></b>"""

    SCAN_TXT = """<b>🧾 ᴘᴀʏᴍᴇɴᴛ ᴅᴇᴛᴀɪʟs:</b>

• sᴄᴀɴ ᴛʜᴇ ǫʀ ᴄᴏᴅᴇ ᴀɴᴅ ᴘᴀʏ <b>₹{}</b>  
• ᴘᴀʏ ᴛʏᴘᴇ: <b>{}</b>
• ᴘʀᴇᴍɪᴜᴍ ᴛɪᴍᴇ: <b>{}</b>
• ǫʀ ᴄᴏᴅᴇ ᴠᴀʟɪᴅ ғᴏʀ <b>5 ᴍɪɴᴜᴛᴇs</b>

<blockquote><b>⚠️ ᴀғᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ:</b>
📸 • sᴇɴᴅ ᴛʜᴇ ᴘᴀʏᴍᴇɴᴛ sᴄʀᴇᴇɴsʜᴏᴛ ʜᴇʀᴇ </blockquote>"""
    
    AUTH_TXT = """<b>👋 ʜᴇʟʟᴏ {} !

⚠️ ᴘʟᴇᴀsᴇ ᴊᴏɪɴ ᴏᴜʀ ᴜᴘᴅᴀᴛᴇs ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴜsᴇ ᴍᴇ !

ᴅᴜᴇ ᴛᴏ sᴇʀᴠᴇʀ ᴏᴠᴇʀʟᴏᴀᴅ, ᴏɴʟʏ ᴏᴜʀ ᴄʜᴀɴɴᴇʟ sᴜʙsᴄʀɪʙᴇʀs ᴄᴀɴ ᴜsᴇ ᴛʜɪs ʙᴏᴛ !</b>"""
    
