class script(object):

    START_TXT = """<b>✨ ʜᴇʟʟᴏ {}!</b>

🚀 <b>ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ {}!</b>  
<i>ᴛʜᴀɴᴋ ʏᴏᴜ ꜰᴏʀ ᴄʜᴏᴏꜱɪɴɢ ᴏᴜʀ ꜱᴇʀᴠɪᴄᴇ.</i>

<blockquote><b>🎥 ᴡʜᴀᴛ ᴡᴇ ᴏꜰꜰᴇʀ:</b>
• ᴀᴄᴄᴇꜱꜱ ᴛᴏ ᴀ ɢʀᴇᴀᴛ ᴄᴏʟʟᴇᴄᴛɪᴏɴ ᴏꜰ ᴍᴏᴠɪᴇꜱ & ꜱᴇʀɪᴇꜱ.
• ꜱᴜʙꜱᴄʀɪᴘᴛɪᴏɴ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ ᴀᴛ ʏᴏᴜʀ ꜰɪɴɢᴇʀᴛɪᴘꜱ.

<b>🔒 ʜᴏᴡ ɪᴛ ᴡᴏʀᴋꜱ:</b>
• ʙᴜʏ ᴀ ꜱᴜʙꜱᴄʀɪᴘᴛɪᴏɴ ᴛᴏ ɢᴇᴛ ᴇɴᴛʀʏ ɪɴᴛᴏ ᴘᴀɪᴅ ᴄʜᴀɴɴᴇʟ ᴡʜᴇʀᴇ ᴡᴇ ᴜᴘʟᴏᴀᴅ ᴀʟʟ ꜱᴛᴜꜰꜰꜱ ʀᴇɢᴜʟᴀʀʟʏ.
• ᴡᴇ ᴡɪʟʟ ʀᴇᴍɪɴᴅ ʏᴏᴜ ᴘʀɪᴏʀ ᴛᴏ ʏᴏᴜʀ ꜱᴜʙꜱᴄʀɪᴘᴛɪᴏɴ ᴇɴᴅꜱ.
• ɪꜰ ʏᴏᴜ ɴᴇᴇᴅ ʜᴇʟᴘ, ᴊᴜꜱᴛ ᴄᴏɴᴛᴀᴄᴛ ᴀᴅᴍɪɴꜱ ! 😊</blockquote>

👇 <b><i>ꜰᴏʟʟᴏᴡ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴꜱ ᴛᴏ ɴᴀᴠɪɢᴀᴛᴇ:</i></b> 🚀"""
    
    LOG_TEXT = """<b>🚀 #NᴇᴡUꜱᴇʀ {}

👤 ɴᴀᴍᴇ - {}
🆔 ɪᴅ - <code>{}</code>
🔗 ᴜꜱᴇʀɴᴀᴍᴇ - {}
⏰ ᴛɪᴍᴇ - {} 
📅 ᴅᴀᴛᴇ - {}
🌍 ᴛɪᴍᴇᴢᴏɴᴇ - Aꜱɪᴀ/Kᴏʟᴋᴀᴛᴀ</b>"""

    HELP_TXT = """<b>❓ ɴᴇᴇᴅ ʜᴇʟᴘ ᴏʀ ꜱᴜᴘᴘᴏʀᴛ? 🤖</b>

<i>ꜰᴏʀ ᴀʟʟ Qᴜᴇʀɪᴇꜱ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ ꜱᴜʙꜱᴄʀɪᴘᴛɪᴏɴꜱ, ᴘʟᴀɴꜱ, ᴏʀ ᴀɴʏᴛʜɪɴɢ ᴇʟꜱᴇ, ᴊᴜꜱᴛ ʀᴇᴀᴄʜ ᴏᴜᴛ ᴛᴏ ᴏᴜʀ ᴀᴅᴍɪɴꜱ ᴀɴᴅ ᴡᴇ ᴡɪʟʟ ɢᴇᴛ ʙᴀᴄᴋ ᴛᴏ ʏᴏᴜ ᴀꜱ ꜱᴏᴏɴ ᴀꜱ ᴘᴏꜱꜱɪʙʟᴇ! ⚡📩</i>

<blockquote><b>📝 ᴛᴇʀᴍꜱ & ᴄᴏɴᴅɪᴛɪᴏɴꜱ:</b>
🔸 ꜱᴇɴᴅ ᴀ ᴄʟᴇᴀʀ ᴘᴀʏᴍᴇɴᴛ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ — ꜰᴀᴋᴇ ᴏʀ ᴇᴅɪᴛᴇᴅ ᴘʀᴏᴏꜰꜱ ᴡɪʟʟ ʟᴇᴀᴅ ᴛᴏ ᴀ ʙᴀɴ.
🔸 ᴘʟᴇᴀꜱᴇ ᴡᴀɪᴛ ᴘᴀᴛɪᴇɴᴛʟʏ ꜰᴏʀ ᴀᴘᴘʀᴏᴠᴀʟ — ᴅᴏ ɴᴏᴛ ꜱᴘᴀᴍ ᴛʜᴇ ʙᴏᴛ.
🔸 ɴᴏ ʀᴇꜰᴜɴᴅꜱ ᴡɪʟʟ ʙᴇ ɪꜱꜱᴜᴇᴅ ᴀꜰᴛᴇʀ ᴘʀᴇᴍɪᴜᴍ ᴀᴄᴛɪᴠᴀᴛɪᴏɴ.</blockquote>

<b>🆘 ꜱᴜᴘᴘᴏʀᴛ & ᴄᴏɴᴛᴀᴄᴛꜱ:</b>
🔹 ᴡᴇ ᴀʀᴇ ᴄᴏᴍᴍɪᴛᴛᴇᴅ ᴛᴏ ꜰᴀꜱᴛ, ꜱᴀꜰᴇ & ʀᴇʟɪᴀʙʟᴇ ꜱᴇʀᴠɪᴄᴇ.  
🔹 ᴄᴏɴᴛᴀᴄᴛ ᴀᴅᴍɪɴ: <b>@XP_Owner_BoT</b>  
🔹 ꜱᴜᴘᴘᴏʀᴛ ᴄʜᴀɴɴᴇʟ: <b>@TenxHubSupport</b>

<i>ʜᴀᴠᴇ ᴀ Qᴜᴇꜱᴛɪᴏɴ? ᴅᴏɴ’ᴛ ʜᴇꜱɪᴛᴀᴛᴇ ᴛᴏ ᴀꜱᴋ!</i>"""

    ABOUT_TXT = """<b>╔═══❰  {}  ❱═══❍
║╭━━━━━━━━━━━━━━━➣
║┣⪼🤖 ᴍʏ ɴᴀᴍᴇ : {}
║┣⪼👑 ᴏᴡɴᴇʀ : <a href='https://t.me/XP_Owner_BoT'>𝚇𝙿 Oᴡɴᴇʀ</a>
║┣⪼👦 ᴅᴇᴠᴇʟᴏᴘᴇʀ : <a href='https://t.me/BOT_OWNER26'>Aᴍᴀɴ Dᴇᴠᴇʟᴏᴘᴇʀ</a>
║┣⪼❣️ ᴜᴘᴅᴀᴛᴇ : <a href='https://t.me/TenxHubBackup'>𝚇𝙿 Bᴏᴛᴢ</a>
║┣⪼📡 ʜᴏꜱᴛᴇᴅ ᴏɴ : Kᴏʏᴇʙ 
║┣⪼🗣️ ʟᴀɴɢᴜᴀɢᴇ : Pʏᴛʜᴏɴ 3
║┣⪼📚 ʟɪʙʀᴀʀʏ : Pʏʀᴏɢʀᴀᴍ
║┣⪼🗒️ ᴠᴇʀꜱɪᴏɴ : Aᴅᴠᴀɴᴄᴇ v2.01
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍ </b>"""
    
    CHECK_TXT = """<blockquote>🎖️ ᴀᴠᴀɪʟᴀʙʟᴇ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴꜱ :</blockquote>

<i>❏ ₹𝟣𝟧   ➠ 𝟣 ᴡᴇᴇᴋ ᴀᴄᴄᴇꜱꜱ  
❏ ₹𝟹𝟿   ➠ 𝟣 ᴍᴏɴᴛʜ 
❏ ₹𝟽𝟻   ➠ 𝟸 ᴍᴏɴᴛʜꜱ  
❏ ₹𝟷𝟷𝟶 ➠ 𝟹 ᴍᴏɴᴛʜꜱ  
❏ ₹𝟷𝟿𝟿 ➠ 𝟼 ᴍᴏɴᴛʜꜱ
❏ ₹𝟹𝟼𝟶 ➠ 𝟷𝟸 ᴍᴏɴᴛʜꜱ</i> <b>(ʙᴇꜱᴛ ᴠᴀʟᴜᴇ)</b>

<b>⚠️ ᴀꜰᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ:</b>  
<i>📸 Sᴇɴᴅ ʏᴏᴜʀ ᴘᴀʏᴍᴇɴᴛ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ꜰᴏʀ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ.</i>

<i><b><u>👇 ᴄʜᴏᴏꜱᴇ ʏᴏᴜʀ ᴘʟᴀɴ ꜰʀᴏᴍ ʙᴜᴛᴛᴏɴꜱ ʙᴇʟᴏᴡ.</u></b></i>"""

    SCAN_TXT = """<b>🧾 ᴘᴀʏᴍᴇɴᴛ ᴅᴇᴛᴀɪʟꜱ:</b>

• ꜱᴄᴀɴ ᴛʜᴇ QR ᴄᴏᴅᴇ ᴀɴᴅ ᴘᴀʏ <b>₹{}</b>  
• Pʀᴇᴍɪᴜᴍ Tɪᴍᴇ: <b>{}</b>
• QR ᴄᴏᴅᴇ ᴠᴀʟɪᴅ ꜰᴏʀ <b>5 ᴍɪɴᴜᴛᴇꜱ</b>

<blockquote><b>⚠️ Aꜰᴛᴇʀ Pᴀʏᴍᴇɴᴛ:</b>
📸 • Sᴇɴᴅ ᴛʜᴇ ᴘᴀʏᴍᴇɴᴛ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ʜᴇʀᴇ </blockquote>"""
    
